cylinder_sdfibm/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application     sdfibm;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         200;

deltaT          0.01;

writeControl    runTime;

writeInterval   10;

purgeWrite      0;

writeFormat     binary;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;
adjustTimeStep no;

functions 
{
}
